use task 6;

drop table if exists catalogs;
create table catalogs(
	id bigint auto_increment not null primary key,
	catalog_name varchar(50)
);

drop table if exists products;
create table products(
	id bigint auto_increment not null primary key,
	product_name varchar(50),
	price bigint not null,
	catalog_id bigint not null,
	foreign key (catalog_id) references catalogs (id)
);

INSERT INTO `catalogs` VALUES ('1','Мясопродукты'),
('2','Безалкогольные напитки'),
('3','Алкогольные напитки'),
('4','Хлебобулочные изделия'),
('5','Молочные продукты'); 

INSERT INTO `products` VALUES ('1','Курица','86','1'),
('2','АкваМинерале','54','2'),
('3','Вино','349','3'),
('4','Батон','25','4'),
('5','Молоко','50','5'),
('6','Баранина','292','1'),
('7','Пепси','40','2'),
('8','Пиво','70','3'),
('9','Кирпичик','19','4'),
('10','Йогурт','13','5'),
('11','Курица Грилль','159','1'),
('12','Спрайт','43','2'),
('13','Водка','190','3'),
('14','Ржаной хлеб','32','4'),
('15','Ряженка','53','5'),
('16','Свинина','175','1'),
('17','Миринда','57','2'),
('18','Шампанское','406','3'),
('19','Бородинский','14','4'),
('20','Кефир','7','5'),
('21','Говядина','2','1'),
('22','РедБулл','104','2'),
('23','Коньяк','724','3'),
('24','Городской','20','4'),
('25','Творог','42','5'),
('26','Мясо цыплят','56','1'),
('27','Горячий ключ','44','2'),
('28','Виски','2016','3'),
('29','Баранки','65','4'),
('30','Тан','80','5'),
('31','Куриные ножки','248','1'),
('32','Бонаква','33','2'),
('33','Текила','1748','3'),
('34','Бублики','50','4'),
('35','Сметана','71','5'),
('36','Мясная нарезка','156','1'),
('37','Миринда','40','2'),
('38','Ягуар','203','3'),
('39','Хлопья','90','4'),
('40','Простокваша','61','5');

select product_name, catalog_name 
from products join catalogs
where catalog_name = (select catalog_name from catalogs where id = products.catalog_id)
order by catalog_name;